update views
